app/views/items/_form.html.erb

SELECT "sub2_categories".* FROM "sub2_categories"
---
    <%= f.label :category_id %>
    <%= f.select :category_id, Category.all.map{|f| [f.name,f.id]} %>

SELECT "types".* FROM "types"
---
     <%= f.label :type_id %>
    <%= f.select :type_id, Type.all.map{|f| [f.listing_type, f.id]} %>

SELECT "statuses".* FROM "statuses"
---
     <%= f.label :status_id %>
    <%= f.select :status_id, Status.all.map{|f| [f.listing_status,f.id]} %>