app/controllers/categories_controller.rb

SELECT "items".* FROM "items" WHERE "items"."category_id" = ?  [["category_id", 31]]
---
  def show
    @items = Item.where(category_id: params[:id])