app/controllers/items_controller.rb

  def search
    @items = Item.search(params)
---
SELECT "items".* FROM "items" WHERE ( name like '%hello%' )

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "address", "category_id", "status_id", "type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "chandana"], ["address", ""], ["category_id", 30], ["status_id", 13], ["type_id", 13], ["created_at", "2015-07-16 10:22:44.155307"], ["updated_at", "2015-07-16 10:22:44.155307"]]